def Mult(P, Q):
    # لیست که میفرستیم مثل ریاضی خودمونه که باید برعکسش کنیم سعودی باشد
    P = P[::-1]
    Q = Q[::-1]

    n = len(P) - 1 # این جا هم گفتم بررسی کنه تعداد را بررسی کند یکی کمتر بشود توان ه ر چند جمله ای
    m = len(Q) - 1

    result = [0] * (n + m + 1) # در اینجا بررسی میکنیم بر اساس درجه جمله ها مثلا درجه ۲ در خود ۳ جمله دارد که یک ارایه بسازد

    for i in range(n + 1):
        for j in range(m + 1):
            result[i + j] += P[i] * Q[j]

    # در نهایت نتیجه را دوباره برعکس می‌کنیم تا به فرم نزولی برگردد
    return result[::-1]


P = [3, 2, 1]  # 3x^2 + 2x + 1
Q = [5, 4]     # 5x + 4

result = Mult(P, Q)
print(result)
